RT-Thread/rt-thread/bsp/apm32/libraries/APM32F10x_Library/APM32F10x_StdPeriphDriver/src/apm32f10x_smc.c
/*!
 * @file        apm32f10x_smc.c
 *
 * @brief       This file provides all the SMC firmware functions
 *
 * @version     V1.0.4
 *
 * @date        2022-12-01
 *
 * @attention
 *
 *  Copyright (C) 2020-2022 Geehy Semiconductor
 *
 *  You may not use this file except in compliance with the
 *  GEEHY COPYRIGHT NOTICE (GEEHY SOFTWARE PACKAGE LICENSE).
 *
 *  The program is only for reference, which is distributed in the hope
 *  that it will be useful and instructional for customers to develop
 *  their software. Unless required by applicable law or agreed to in
 *  writing, the program is distributed on an "AS IS" BASIS, WITHOUT
 *  ANY WARRANTY OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the GEEHY SOFTWARE PACKAGE LICENSE for the governing permissions
 *  and limitations under the License.
 */

#include "apm32f10x_smc.h"
#include "apm32f10x_rcm.h"

/** @addtogroup APM32F10x_StdPeriphDriver
  @{
*/

/** @addtogroup SMC_Driver SMC Driver
  * @brief SMC driver modules
  @{
*/

/** @defgroup SMC_Functions Functions
  @{
*/

/*!
 * @brief     Reset the EMMMC NOR/SRAM Banks registers
 *
 * @param     bank: Select the EMMMC Bank.
 *                  The parameter can be one of following values:
 *                  @arg SMC_BANK1_NORSRAM_1: SMC Bank1 NOR/SRAM1
 *                  @arg SMC_BANK1_NORSRAM_2: SMC Bank1 NOR/SRAM2
 *                  @arg SMC_BANK1_NORSRAM_3: SMC Bank1 NOR/SRAM3
 *                  @arg SMC_BANK1_NORSRAM_4: SMC Bank1 NOR/SRAM4
 *
 * @retval    None
 */
void SMC_ResetNORSRAM(SMC_BANK1_NORSRAM_T bank)
{
    /* SMC_BANK1_NORSRAM_1 */
    if (bank == SMC_BANK1_NORSRAM_1)
    {
        SMC_Bank1->SNCTRL_T[bank] = 0x000030DB;
    }
    /* SMC_BANK1_NORSRAM_2, SMC_BANK1_NORSRAM_3 or SMC_BANK1_NORSRAM_4 */
    else
    {
        SMC_Bank1->SNCTRL_T[bank] = 0x000030D2;
    }
    SMC_Bank1->SNCTRL_T[bank + 1] = 0x0FFFFFFF;
    SMC_Bank1E->WRTTIM[bank] = 0x0FFFFFFF;
}

/*!
 * @brief     Reset the EMMMC NAND Banks registers
 *
 * @param     bank: Select the EMMMC Bank.
 *                  The parameter can be one of following values:
 *                  @arg SMC_BANK2_NAND: FSMC Bank2 NAND
 *                  @arg SMC_BANK3_NAND: FSMC Bank3 NAND
 *
 * @retval    None
 */
void SMC_ResetNAND(SMC_BANK_NAND_T bank)
{
    if (bank == SMC_BANK2_NAND)
    {
        /* Set the SMC_Bank2 registers to their reset values */
        SMC_Bank2->CTRL2   = 0x00000018;
        SMC_Bank2->STSINT2 = 0x00000040;
        SMC_Bank2->CMSTIM2 = 0xFCFCFCFC;
        SMC_Bank2->AMSTIM2 = 0xFCFCFCFC;
    }
    /* SMC BANK3 NAND */
    else
    {
        /* Set the SMC_Bank3 registers to their reset values */
        SMC_Bank3->CTRL3   = 0x00000018;
        SMC_Bank3->STSINT3 = 0x00000040;
        SMC_Bank3->CMSTIM3 = 0xFCFCFCFC;
        SMC_Bank3->AMSTIM3 = 0xFCFCFCFC;
    }
}

/*!
 * @brief     Reset the EMMMC PCCARD Banks registers
 *
 * @param     None
 *
 * @retval    None
 */
void SMC_ResetPCCard(void)
{
    /* Set the SMC_Bank4 registers to their reset values */
    SMC_Bank4->CTRL4   = 0x00000018;
    SMC_Bank4->STSINT4 = 0x00000040;
    SMC_Bank4->CMSTIM4 = 0xFCFCFCFC;
    SMC_Bank4->AMSTIM4 = 0xFCFCFCFC;
    SMC_Bank4->IOSTIM4 = 0xFCFCFCFC;
}

/*!
 * @brief     Configures the SMC NOR/SRAM Banks according to the specified parameters in the smcNORSRAMConfig.
 *
 * @param     smcNORSRAMConfig: Point to a SMC_NORSRAMConfig_T structure
 *
 * @retval    None
 */
void SMC_ConfigNORSRAM(SMC_NORSRAMConfig_T* smcNORSRAMConfig)
{
    /* Bank1 NOR/SRAM control register configuration */
    SMC_Bank1->SNCTRL_T[smcNORSRAMConfig->bank] =
        (uint32_t)smcNORSRAMConfig->dataAddressMux |
        smcNORSRAMConfig->memoryType |
        smcNORSRAMConfig->memoryDataWidth |
        smcNORSRAMConfig->burstAcceesMode |
        smcNORSRAMConfig->asynchronousWait |
        smcNORSRAMConfig->waitSignalPolarity |
        smcNORSRAMConfig->wrapMode |
        smcNORSRAMConfig->waitSignalActive |
        smcNORSRAMConfig->writeOperation |
        smcNORSRAMConfig->waiteSignal |
        smcNORSRAMConfig->extendedMode |
        smcNORSRAMConfig->writeBurst;

    if (smcNORSRAMConfig->memoryType == SMC_MEMORY_TYPE_NOR)
    {
        SMC_Bank1->SNCTRL_T[smcNORSRAMConfig->bank] |= 0x00000040;
    }

    /* Bank1 NOR/SRAM timing register configuration */
    SMC_Bank1->SNCTRL_T[smcNORSRAMConfig->bank + 1] =
        (uint32_t)smcNORSRAMConfig->readWriteTimingStruct->addressSetupTime |
        (smcNORSRAMConfig->readWriteTimingStruct->addressHodeTime << 4) |
        (smcNORSRAMConfig->readWriteTimingStruct->dataSetupTime << 8) |
        (smcNORSRAMConfig->readWriteTimingStruct->busTurnaroundTime << 16) |
        (smcNORSRAMConfig->readWriteTimingStruct->clockDivision << 20) |
        (smcNORSRAMConfig->readWriteTimingStruct->dataLatency << 24) |
        smcNORSRAMConfig->readWriteTimingStruct->accessMode;

    /* Bank1 NOR/SRAM timing register for write configuration, if extended mode is used */
    if (smcNORSRAMConfig->extendedMode == SMC_EXTENDEN_MODE_ENABLE)
    {
        SMC_Bank1E->WRTTIM[smcNORSRAMConfig->bank] =
            (uint32_t)smcNORSRAMConfig->writeTimingStruct->addressSetupTime |
            (smcNORSRAMConfig->writeTimingStruct->addressHodeTime << 4) |
            (smcNORSRAMConfig->writeTimingStruct->dataSetupTime << 8) |
            (smcNORSRAMConfig->writeTimingStruct->clockDivision << 20) |
            (smcNORSRAMConfig->writeTimingStruct->dataLatency << 24) |
            smcNORSRAMConfig->writeTimingStruct->accessMode;
    }
    else
    {
        SMC_Bank1E->WRTTIM[smcNORSRAMConfig->bank] = 0x0FFFFFFF;
    }
}

/*!
 * @brief     Configures the SMC NAND Banks according to the specified parameters in the smcNANDConfig.
 *
 * @param     smcNANDConfig : Point to a SMC_NANDConfig_T structure.
 *
 * @retval    None
 */
void SMC_ConfigNAND(SMC_NANDConfig_T* smcNANDConfig)
{
    uint32_t tmppcr = 0x00000000, tmppmem = 0x00000000, tmppatt = 0x00000000;

    /* Set the tmppcr value according to SMC_NANDInitStruct parameters */
    tmppcr = (uint32_t)smcNANDConfig->waitFeature | 0x00000008 |
             smcNANDConfig->memoryDataWidth |
             smcNANDConfig->ECC |
             smcNANDConfig->ECCPageSize |
             (smcNANDConfig->TCLRSetupTime << 9) |
             (smcNANDConfig->TARSetupTime << 13);

